examples/consistency/sodShockTube/0/U
                                                                               
                             
                                                                   
                                                            
                                          
                             
                                                                               
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
                                                                               

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    yEmpty
    {
        type            empty;
    }
    zEmpty
    {
        type            empty;
    }
}


                                                                               
