examples/consistency/sodShockTube/0/p
                                                                               
                             
                                                                   
                                                            
                                          
                             
                                                                               
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
                                                                               

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
200
(
100000
100000
100000
100000
100000
100000
100000
100000
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    yEmpty
    {
        type            empty;
    }
    zEmpty
    {
        type            empty;
    }
}


                                                                               
