examples/consistency/sodShockTube/0/T
                                                                               
                             
                                                                   
                                                            
                                          
                             
                                                                               
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
                                                                               

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
200
(
348.43205574913
348.43205574913
348.43205574913
348.43205574913
348.43205574913
348.43205574913
348.43205574913
348.43205574913
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    yEmpty
    {
        type            empty;
    }
    zEmpty
    {
        type            empty;
    }
}


                                                                               
