examples/consistency/sodShockTube/0/rho
                                                                               
                             
                                                                   
                                                            
                                          
                             
                                                                               
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
                                                                               

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
200
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    yEmpty
    {
        type            empty;
    }
    zEmpty
    {
        type            empty;
    }
}


                                                                               
