examples/consistency/sodShockTube/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers {}
relaxationFactors {}
